app/views/api/businesses/index.json.jbuilder

    json.partial! '/api/businesses/business', business:business
    json.businessPhoto url_for(business.photo.first)
---
SELECT "businesses".* FROM "businesses"