app/views/api/businesses/show.json.jbuilder

SELECT "keywords".* FROM "keywords" INNER JOIN "categories" ON "keywords"."id" = "categories"."keyword_id" WHERE "categories"."business_id" = $1  [["business_id", 14]]
---
json.set! :keywords do
  @business.keyword.each do |k|