app/views/api/businesses/show.json.jbuilder

SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 8]]
---
json.set! :reviews do
  @business.reviews.each do |rev|

SELECT "reviews".* FROM "reviews" WHERE "reviews"."business_id" = $1  [["business_id", 14]]
---
json.set! :users do
  @business.reviews.each do |rev|