app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "YYS1ql0hwuIceuLVniSSag"], ["id", 12]]
---
  def reset_session_token
    generate_session_token
    self.save!

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "QFkYZSpCJVaPFxQDJrJboQ"], ["LIMIT", 1]]
---
  def generate_session_token
    self.session_token = SecureRandom.urlsafe_base64
    while User.find_by(session_token: self.session_token)